#Задача 8. Палиндром
s = input("Введите строку: ")

if s == s[::-1]:
    print("Палиндром")
else:
    print("Не палиндром")