#Задача 10. Арифметика
a = int(input("Введите a: "))
b = int(input("Введите b: "))

print("Сумма:", a + b)
print("Разность:", a - b)
print("Произведение:", a * b)
print("Частное:", a / b)
print("Остаток:", a % b)
print("Степень:", a ** b)